In [1]:
!git clone https://github.com/MudduChaithanyaSai/internship-test2.git

Cloning into 'internship-test2'...
remote: Enumerating objects: 26, done.
remote: Counting objects: 100% (26/26), done.
remote: Compressing objects: 100% (19/19), done.
remote: Total 26 (delta 7), reused 15 (delta 2), pack-reused 0
Unpacking objects: 100% (26/26), done.

In [3]:
import pandas as pd

In [4]:
data_path = "/content/internship-test2/input/question-2/main.csv"

In [5]:
df = pd.read_csv(data_path)

In [6]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [18]:
res = df.groupby("occupation").agg({"age":["min", "max"]})

In [19]:
res.head()

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70

In [20]:
res.to_csv("/content/internship-test2/output/answer-2/main.csv")